It's a diff detected in `my_security_group_2`'s `name_prefix` value that triggers its recreation:

```console
$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.my_security_group_1 will be created
  + resource "aws_security_group" "my_security_group_1" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "my-security-group1_arbitrary-value"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "my-security-group1_arbitrary-value"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.my_security_group_2 will be created
  + resource "aws_security_group" "my_security_group_2" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "my-security-group2_7944a1f67f50751eb9d978e7264ca2afabd9bed7507bad11b16493c4271b43d7238cc9970263177777d40447ec2d48d2889e6f785fd3ccc790a1f017e8eb5bc5"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "my-security-group2_7944a1f67f50751eb9d978e7264ca2afabd9bed7507bad11b16493c4271b43d7238cc9970263177777d40447ec2d48d2889e6f785fd3ccc790a1f017e8eb5bc5"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_vpc.my_vpc will be created
  + resource "aws_vpc" "my_vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = (known after apply)
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "my-vpc_7944a1f67f50751eb9d978e7264ca2afabd9bed7507bad11b16493c4271b43d7238cc9970263177777d40447ec2d48d2889e6f785fd3ccc790a1f017e8eb5bc5"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_vpc.my_vpc: Creating...
aws_vpc.my_vpc: Creation complete after 5s [id=vpc-02b0f7f3fc213c78c]
aws_security_group.my_security_group_2: Creating...
aws_security_group.my_security_group_1: Creating...
aws_security_group.my_security_group_2: Creation complete after 3s [id=sg-0067360a8928a66fb]
aws_security_group.my_security_group_1: Creation complete after 3s [id=sg-0bb932a9d49fb5c7b]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
$ terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

aws_vpc.my_vpc: Refreshing state... [id=vpc-02b0f7f3fc213c78c]
aws_security_group.my_security_group_2: Refreshing state... [id=sg-0067360a8928a66fb]
aws_security_group.my_security_group_1: Refreshing state... [id=sg-0bb932a9d49fb5c7b]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group.my_security_group_2 must be replaced
-/+ resource "aws_security_group" "my_security_group_2" {
      ~ arn                    = "arn:aws:ec2:us-west-2:000000000000:security-group/sg-0067360a8928a66fb" -> (known after apply)
        description            = "Managed by Terraform"
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-0067360a8928a66fb" -> (known after apply)
      ~ ingress                = [] -> (known after apply)
        name                   = "my-security-group2_7944a1f67f50751eb9d978e7264ca2afabd9bed7507bad11b16493c4271b43d7238cc9970263177777d40447ec2d48d2889e6f785fd3ccc790a1f017e8eb5bc5"
      - name_prefix            = "my-security-group2_7944a1f67f50751eb9d978e7264ca2afabd9bed7507bad11b16493c4271b43d7238cc9970263177777d40447ec2d48d2889e6f" -> null # forces replacement
      ~ owner_id               = "346386234494" -> (known after apply)
        revoke_rules_on_delete = false
        tags                   = {
            "Name" = "my-security-group2_7944a1f67f50751eb9d978e7264ca2afabd9bed7507bad11b16493c4271b43d7238cc9970263177777d40447ec2d48d2889e6f785fd3ccc790a1f017e8eb5bc5"
        }
        vpc_id                 = "vpc-02b0f7f3fc213c78c"
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```